DataProcessors/ОргСхема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ОргСхема</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИА_АдресацияЗадачПланаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_АдресацияЗадачПланаДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АрхивОргсхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АрхивОргсхем</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Макет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипТерминалаОргСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипТерминалаОргСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учредитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководящийСостав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Департамент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Секция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сектор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОргСхема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОргСхема</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТерминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТерминалаОргСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоднятьВверх</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВСхеме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляОргсхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСтатистик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_НастройкиРабочегоСтолаСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотографии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЦКП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОЗаполненииСтатистик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_УведомленияОЗаполненииСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВложеннаяОргсхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВложеннуюОргсхему</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Статистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_Инструкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_Инструкции</Name>
			<Comment>Должностные инструкции</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипИнструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ТипыИнструкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Теги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИнструкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СтатусИнструкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКолонтитула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВремКаталогаВорд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияГугл</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаГуглДок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсемСотрудникам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Серии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокТегов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВерсииДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСоздания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОргСхема/Forms/ФормаУпр/Ext/Form/Module.bsl
&НаКлиенте
Перем МассивНарисованныхЭлементов, Лево, Верх, Итер;
&НаСервере
Перем ПредВыделение;

&НаКлиенте
Процедура ПолучитьИзАрхива(Команда)
	
	ОткрытьФорму("Обработка.ОргСхема.Форма.ФормаПолученияИзАрхиваУпр",,,,,, Новый ОписаниеОповещения("ПолучитьИзАрхиваЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИзАрхиваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	рез = Результат;
	
	Если рез<>Неопределено Тогда
		ПолучитьИзАрхиваНаСервере(рез);
		ЗагруженаИзАрхива = Истина;
		Элементы.ОргСхемаКонтекстноеМенюГруппа.Доступность = Не ЗагруженаИзАрхива;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьИзАрхиваНаСервере(Макет)
	ОргСхема.Очистить();
	ОргСхема.Вывести(Макет);
	ОргСхема.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	Элементы.ГруппаСписокПроблем.Видимость = ложь;
	
	Если Объект.Организация.Пустая() Тогда
		ПоказатьПредупреждение(,"Выберите организацию!");
		Возврат;
	КонецЕсли;
	
	ОбновитьОС(МассивНарисованныхЭлементов);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОС(МассивНарисованныхЭлементов)
	
	Рисунок = Элементы.ОргСхема.ТекущаяОбласть;
	Если ТипЗнч(Рисунок) = Тип("РисунокТабличногоДокумента") Тогда
		Попытка
			Лево = Рисунок.Лево + Рисунок.Ширина / 2;
			Верх = Рисунок.Верх + Рисунок.Высота / 2;
		Исключение
			Лево = 0;
        	Верх = 0;
		КонецПопытки;
    Иначе
        Лево = 0;
        Верх = 0;
    КонецЕсли;  
    
    ОргСхема1 = Новый ТабличныйДокумент;
    ИА_ОргСхема_Клиент.ПостроитьОС(Объект.Организация, ОргСхема1, МассивНарисованныхЭлементов);
	
	//ВывестиТабДок(ОргСхема1);
	ОргСхема = ОргСхема1;
	
    Элементы.ОргСхема.ТолькоПросмотр = Истина;
    ЗагруженаИзАрхива = Ложь;
    Элементы.ОргСхемаКонтекстноеМенюГруппа.Доступность = Не ЗагруженаИзАрхива;
    
	Если Лево > 0 И Верх > 0 Тогда
		Итер = 0;
	    ПодключитьОбработчикОжидания("Спозиционировать", 0.1, истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВывестиТабДок(ОргСхема1)
	ОргСхема.Очистить();
	ОргСхема.Вывести(ОргСхема1);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.Организация.Пустая() Тогда
		ОргСхема = Новый ТабличныйДокумент;
		Элементы.ОргСхема.ТолькоПросмотр = Истина;
		ЗагруженаИзАрхива = Ложь;
		Элементы.ОргСхемаКонтекстноеМенюГруппа.Доступность = Ложь;
	Иначе
		ОбновитьОС(МассивНарисованныхЭлементов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СсылкуВСтруктуру(Ссылка, Поля = "")
	
	Д = Новый Структура(Поля);
	ЗаполнитьЗначенияСвойств(Д, Ссылка.ПолучитьОбъект());
	Возврат Д;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьПодчиненного(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;
	
	Если ТекЭлем = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЭлемента = СсылкуВСтруктуру(ТекЭлем, "Ссылка, ТипТерминала");
	
	Если ЗначениеЗаполнено(ТекЭлем) и ТипЗнч(ТекЭлем) = Тип("СправочникСсылка.ОргСхема") Тогда
		Если ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Сотрудник") Тогда
			возврат;
		КонецЕсли;
		
		Если ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Учредитель") Тогда
			ТипТерминала1 = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.РуководящийСостав");
		ИначеЕсли ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.РуководящийСостав") Тогда
			ТипТерминала1 = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Департамент");
		ИначеЕсли ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Департамент") Тогда
			ТипТерминала1 = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел");
		ИначеЕсли ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел") Тогда
			ТипТерминала1 = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Секция");
		ИначеЕсли ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Секция") Тогда
			ТипТерминала1 = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Сектор");			
		ИначеЕсли ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Сектор") Тогда
			ТипТерминала1 = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Сотрудник");			
		КонецЕсли;
		
		ЭтоГруппа = ТипТерминала1 <> ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Сотрудник");
		Парам = Новый Структура("Родитель,ТипТерминала,ЭтоГруппа", ТекЭлем,ТипТерминала1,ЭтоГруппа);
		
		ОткрытьФорму("Справочник.ОргСхема.ФормаГруппы", парам,ЭтаФорма,,,,Новый ОписаниеОповещения("ОбновитьОСОбр",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОСОбр(рез,дп) Экспорт
	ОбновитьОС(МассивНарисованныхЭлементов);
КонецПроцедуры


&НаКлиенте
Процедура ДолжностныеИнструкции(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;
	Если ЗначениеЗаполнено(ТекЭлем) и ТипЗнч(ТекЭлем) = Тип("СправочникСсылка.ОргСхема") Тогда	
		ф = ПолучитьФорму("Обработка.ИА_РаботаСИнструкциями.Форма.ФормаУправляемая");
		ф.Пост = ТекЭлем;
		ф.Открыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗРС(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;
	Если ТекЭлем = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекЭлем) и ТипЗнч(ТекЭлем) = Тип("СправочникСсылка.ОргСхема") Тогда
		
		Парам = Новый Структура("ЭтоЗРС,Пост", Истина,ТекЭлем);
		ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.ФормаОбъекта",Парам,ЭтаФорма);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбозначитьПутьНаСхеме(ПостКому, ЗадачаСсылка, МассивНарисованныхЭлементов)
	массивПостов = ПолучитьСписокПостовМаршрута(ЗадачаСсылка);
	
	Для каждого стр из МассивНарисованныхЭлементов Цикл
		Если массивПостов.Найти(стр.Ссылка)<>Неопределено Тогда
			Элем = ОргСхема.Рисунки[стр.Элемент];
			
			Обводка = ОргСхема.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямоугольник);
			ЗаполнитьЗначенияСвойств(Обводка, Элем);
			Обводка.Узор = ТипУзораТабличногоДокумента.БезУзора;
			
			Обводка.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная,3);
			Обводка.ЦветЛинии = Новый Цвет(255,50,50);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПостовМаршрута(пЗадача)
	возврат пЗадача.Маршрут.ВыгрузитьКолонку("Пост");
КонецФункции

&НаСервереБезКонтекста
Функция МассивПользовтелейПоПосту(Пост)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИА_АдресацияЗадачПланаДействий.Пользователь
	|ИЗ
	|	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	|ГДЕ
	|	ИА_АдресацияЗадачПланаДействий.Пост = &Пост";
	Запрос.УстановитьПараметр("Пост", Пост);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
КонецФункции

&НаКлиенте
Процедура ОтправитьПослание(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;
	Если ТекЭлем = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекЭлем) и ТипЗнч(ТекЭлем) = Тип("СправочникСсылка.ОргСхема") Тогда
		
		масПользователей = МассивПользовтелейПоПосту(ТекЭлем);
		
		Парам = Новый Структура("ЭтоПослание", Истина);
		ФПослание = ПолучитьФорму("Задача.ИА_ЗадачаПланаДействий.ФормаОбъекта", Парам);
		обПослание = ФПослание.Объект;
		
		//обПослание = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
		
		Если масПользователей.Количество() = 0 Тогда 
			Сообщить("По данному посту не найден пользователь в адресации коммцентра!");
			возврат;
		ИначеЕсли масПользователей.Количество() = 1 Тогда 
			обПослание.Пользователь = масПользователей[0];
		Иначе
			СписокПольз = Новый СписокЗначений;
			СписокПольз.ЗагрузитьЗначения(масПользователей);
			
			РезПольз = Неопределено;

			
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ОтправитьПосланиеЗавершение", ЭтотОбъект, Новый Структура("обПослание, ФПослание", обПослание, ФПослание)), СписокПольз);
            Возврат;
		КонецЕсли;
		
		//обПослание.ЭтоПослание = Истина;
		ОтправитьПосланиеФрагмент(ФПослание);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПосланиеЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	обПослание = ДополнительныеПараметры.обПослание;
	ФПослание = ДополнительныеПараметры.ФПослание;
	
	
	РезПольз = ВыбранныйЭлемент;
	
	Если РезПольз <> Неопределено Тогда
		обПослание.Пользователь = РезПольз.Значение;
	Иначе
		Возврат;
	КонецЕсли;
	
	ОтправитьПосланиеФрагмент(ФПослание);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПосланиеФрагмент(Знач ФПослание)
	
	ФПослание.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ПоставитьЗадачу(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;
	Если ТекЭлем = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекЭлем) и ТипЗнч(ТекЭлем) = Тип("СправочникСсылка.ОргСхема") Тогда		
		Парам = Новый Структура("Пост", ТекЭлем);
		ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.ФормаОбъекта",Парам,ЭтаФорма,новый УникальныйИдентификатор);		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТекущиеЗадачи(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;
	Если ТекЭлем = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекЭлем) и ТипЗнч(ТекЭлем) = Тип("СправочникСсылка.ОргСхема") Тогда
		ф = ПолучитьФорму("Обработка.ОргСхема.Форма.ЗадачиУпр", Новый Структура("Пост,Ключ", ТекЭлем,ТекЭлем));
		ф.Открыть();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекПользователь()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаКлиенте
Процедура Планы(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;
	Если ТекЭлем = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекЭлем) и ТипЗнч(ТекЭлем) = Тип("СправочникСсылка.ОргСхема") Тогда		
		Парам = Новый Структура("ОтборПост", ТекЭлем);
		фПланы = ПолучитьФорму("Обработка.ИА_КСУ_РабочийСтол.Форма.ПланыСотрудников",Парам);
		фПланы.Открыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтатистики(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;
	Если ТекЭлем = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	ДанныеЭлемента = СсылкуВСтруктуру(ТекЭлем, "НастройкаСтатистик");
	
	Если ЗначениеЗаполнено(ТекЭлем) и ТипЗнч(ТекЭлем) = Тип("СправочникСсылка.ОргСхема") Тогда
		Если ДанныеЭлемента.НастройкаСтатистик.Пустая() Тогда
			ПоказатьПредупреждение(,"Укажите настройку статистик для поста!");
			Возврат;
		КонецЕсли;
		
		
		ф = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма.Форма");
		ф.Открыть();
		ф.Объект.Настройка = ДанныеЭлемента.НастройкаСтатистик;
		ф.НастройкаПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВАрхив(Команда)
	НаимЗаписи = Строка(Объект.Организация);
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПоместитьВАрхивЗавершение", ЭтотОбъект, Новый Структура("НаимЗаписи", НаимЗаписи)), НаимЗаписи, "Наименование макета оргсхемы");
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВАрхивЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	НаимЗаписи = ?(Значение = Неопределено, ДополнительныеПараметры.НаимЗаписи, Значение);
	
	
	Если (Значение <> Неопределено) и СокрЛП(НаимЗаписи)<>"" Тогда
		ОбновитьОС(МассивНарисованныхЭлементов);
		ПоместитьВАрхивНаСервере(НаимЗаписи);	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоместитьВАрхивНаСервере(ИмяМакета)
	МенЗаписи = РегистрыСведений.АрхивОргсхем.СоздатьМенеджерЗаписи();
	МенЗаписи.Период = ТекущаяДата();
	МенЗаписи.Наименование = ИмяМакета;
	МенЗаписи.Макет = Новый ХранилищеЗначения(ОргСхема.ПолучитьОбласть());
	МенЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;

	Если ТекЭлем = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьЗавершение", ЭтотОбъект, Новый Структура("ТекЭлем", ТекЭлем)), "Удалить терминал """ + СокрЛП(Строка(ТекЭлем)) + """?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекЭлем = ДополнительныеПараметры.ТекЭлем;
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда	
		
		УстановитьПометкуУдаления(ТекЭлем);
		ОбновитьОС(МассивНарисованныхЭлементов);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуУдаления(ТекЭлем)
	
	ТекОб = ТекЭлем.ПолучитьОбъект();
	ТекОб.УстановитьПометкуУдаления(Истина,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаСписокПроблем.Видимость = Ложь;
	
	Если не ИА_Защита_Общий.ЛицензияДоступна("Оргсхема") Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		ПодключитьРасширениеРаботыСФайлами();
	#КонецЕсли
	
	Если не Объект.Организация.Пустая() Тогда
		Попытка
			ОбновитьОС(МассивНарисованныхЭлементов);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
    ОбновлятьПриРедактировании	= Истина;
	ПредИдЭлем = -1;
	ПредИдЭлем1 = -1;
КонецПроцедуры


&НаКлиенте
Процедура СохранитьКакPDF(Команда)
	
	#ЕСЛИ ВебКлиент Тогда
	    Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтаФорма, новый Структура("формат", "PDF"));
	    НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	#ИНАЧЕ
	ТабДок = ПолучитьТабличныйДокументНаСервере(Истина);
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("az='PDF';be='PDF';en='PDF';kk='PDF';ky='PDF';md='PDF';ru='PDF';tg='PDF';tk='PDF';uk='PDF';uz='PDF'")
	    + "(*.pdf)|*.pdf";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
	    ТабДок.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	КонецЕсли; 
	#КОНЕЦЕСЛИ
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодключениеРасширенияРаботыСФайламиЗавершение(Подключено, ДополнительныеПараметры) Экспорт
    Если Не Подключено Тогда
        Оповещение = Новый ОписаниеОповещения("НачатьУстановкуРасширенияРаботыСФайламиЗавершение", ЭтаФорма, ДополнительныеПараметры);
        ТекстСообщения = НСтр("ru='Для продолжении работы необходимо установить расширение для веб-клиента ""1С:Предприятие"". Установить?'");
        ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет); 
	Иначе
		Если ДополнительныеПараметры.формат = "PDF" Тогда
			дд = ПолучитьТабличныйДокументНаСервере(Истина, истина);
			адрес = ПоместитьВоВременноеХранилище(дд);
			ПолучитьФайл(адрес,"org.pdf", истина);
		ИначеЕсли ДополнительныеПараметры.формат = "XLS" Тогда
			дд = ПолучитьXLSНаСервере();
			адрес = ПоместитьВоВременноеХранилище(дд);
			ПолучитьФайл(адрес,"org.xls", истина);
		КонецЕсли;

    КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуРасширенияРаботыСФайламиЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        НачатьУстановкуРасширенияРаботыСФайлами();
    КонецЕсли;    
КонецПроцедуры


&НаКлиенте
Процедура СохранитьКакXLS(Команда)
	
	#ЕСЛИ ВебКлиент Тогда
	    Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтаФорма, новый Структура("формат", "XLS"));
	    НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	#ИНАЧЕ
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("az='XLS';be='XLS';en='XLS';kk='XLS';ky='XLS';md='XLS';ru='XLS';tg='XLS';tk='XLS';uk='XLS';uz='XLS'")
	    + "(*.xls)|*.xls";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
	    ОргСхема.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLS);
	КонецЕсли; 
	#КОНЕЦЕСЛИ
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ОргСхема.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
	
КонецПроцедуры

&НаКлиенте
Процедура ОргСхемаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ЗагруженаИзАрхива Тогда
		// не даем открывать блоки, т.к. оргсхема загржена из архива
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
		
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;

	Если ТекЭлем <>  Неопределено Тогда
		ПоказатьЗначение(,ТекЭлем);
	КонецЕсли;
	
	ОбновитьОС(МассивНарисованныхЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокументНаСервере(АвтоМасштаб, этоВеб = ложь)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывести(ОргСхема);
	ТабДок.АвтоМасштаб = АвтоМасштаб;
	
	Если Не АвтоМасштаб Тогда
		ТабДок.МасштабПечати = 100;
	КонецЕсли;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Если этоВеб Тогда
		вр = КаталогВременныхФайлов() + "org1111.pdf";
		ТабДок.Записать(вр, ТипФайлаТабличногоДокумента.PDF);
		
		дд = новый ДвоичныеДанные(вр);
		УдалитьФайлы(вр);
		Возврат дд;
	Иначе
		Возврат ТабДок;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьXLSНаСервере()
	
	вр = КаталогВременныхФайлов() + "org1111.xls";
	ОргСхема.Записать(вр, ТипФайлаТабличногоДокумента.XLS);
	
	дд = новый ДвоичныеДанные(вр);
	УдалитьФайлы(вр);
	Возврат дд;
	
КонецФункции


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ИмяСобытия = "ИзменениеОС" И ОбновлятьПриРедактировании Тогда
		ОбновитьОС(МассивНарисованныхЭлементов);
	ИначеЕсли ИмяСобытия = "ЗакрытиеЗадачиБП" и Параметр<>Неопределено И Параметр.ВладелецФормы = ЭтаФорма Тогда
		Если (не Параметр.Ссылка.Пустая()) и Параметр.ПоКомлиниям Тогда
			ОбозначитьПутьНаСхеме(Параметр.Пост, Параметр.Ссылка, МассивНарисованныхЭлементов);
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПанельДополнительно(Команда)
    Элементы.ПанельДополнительно.Пометка = НЕ Элементы.ПанельДополнительно.Пометка;
    Элементы.группаДополнительно.Видимость = Элементы.ПанельДополнительно.Пометка;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Элементы.группаДополнительно.Видимость = Элементы.ПанельДополнительно.Пометка;
	ЕстьПравоРедактированияОргСхемы    = ПравоДоступа("Редактирование",Метаданные.Справочники.ОргСхема);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВправо(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;
	
	Если ТекЭлем = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПереместитьВправоНаСервере(ТекЭлем);
	ОбновитьОС(МассивНарисованныхЭлементов);
КонецПроцедуры

&НаСервере
Процедура ПереместитьВправоНаСервере(ТекЭлем)
	ТекРодитель = ТекЭлем.Родитель;
	
	Если ЗначениеЗаполнено(ТекРодитель) и ТипЗнч(ТекРодитель) = Тип("СправочникСсылка.ОргСхема") Тогда
		Подчиненные = ПолучитьПодчиненные(ТекРодитель); 
		ТекСтрока = Подчиненные.Найти(ТекЭлем,"Ссылка" );
		Если Подчиненные.Количество() = ТекСтрока.НомерСтроки Тогда //Крайний
			//СледСтрока = Подчиненные.Найти(1,"НомерСтроки" );
			Для каждого ТекЭлемент Из Подчиненные Цикл
				Если ТекЭлемент = ТекСтрока Тогда
					ТекОбъект = ТекЭлемент.Ссылка.ПолучитьОбъект();
					ТекОбъект.ПорядокВСхеме = Подчиненные.Найти(1,"НомерСтроки" );
					ТекОбъект.Записать();
				Иначе
					ТекОбъект = ТекЭлемент.Ссылка.ПолучитьОбъект();
					ТекОбъект.ПорядокВСхеме = ТекОбъект.ПорядокВСхеме+1;
					ТекОбъект.Записать();
				КонецЕсли;
			КонецЦикла;
		Иначе //обычное смещение
			СледСтрока = Подчиненные.Найти(ТекСтрока.НомерСтроки+1,"НомерСтроки" );
			
			ТекОбъект = ТекСтрока.Ссылка.ПолучитьОбъект();
			ТекОбъект.ПорядокВСхеме = СледСтрока.ПорядокВСхеме;
			ТекОбъект.Записать();
			СледОбъект = СледСтрока.Ссылка.ПолучитьОбъект();
			СледОбъект.ПорядокВСхеме = ТекСтрока.ПорядокВСхеме;
			СледОбъект.Записать();
		КонецЕсли;
		//ОбновитьОС(МассивНарисованныхЭлементов);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПодчиненные(ТекРодитель)
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать 
					|	ОргСхема.Ссылка,
					|	ОргСхема.ПорядокВСхеме
					|Из Справочник.ОргСхема Как ОргСхема
					|Где ОргСхема.Родитель = &Родитель
					|	И ОргСхема.ПометкаУдаления = Ложь
					|Упорядочить ПО ОргСхема.ПорядокВСхеме";
	Запрос.УстановитьПараметр("Родитель",ТекРодитель);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Таб = Новый ТаблицаЗначений;
	НомерСтроки = 1;
	Таб.Колонки.Добавить("НомерСтроки");
	Таб.Колонки.Добавить("Ссылка");
    Таб.Колонки.Добавить("ПорядокВСхеме");
	Пока РезультатЗапроса.Следующий() Цикл
		Стр = Таб.Добавить();
		Стр.НомерСтроки = НомерСтроки;
    	Стр.Ссылка = РезультатЗапроса.Ссылка;
		Стр.ПорядокВСхеме = РезультатЗапроса.ПорядокВСхеме;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	Возврат Таб;
КонецФункции


&НаКлиенте
Процедура ОргСхемаПриАктивизацииОбласти(Элемент)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;
	
	Если ТекЭлем = Неопределено Тогда
		Элементы.ОргСхемаКонтекстноеМенюВывестиОтдельно.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	Элементы.ОргСхемаКонтекстноеМенюОткрытьОргсхемуСекции.Видимость = Ложь;
	
	ДанныеЭлемента = СсылкуВСтруктуру(ТекЭлем, "Ссылка, ТипТерминала,СсылкаНаВложеннуюОргсхему");
	
	Доступ = ПроверитьДоступ();
	
	Если ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Учредитель") Тогда
		Элементы.ОргСхемаКонтекстноеМенюВывестиОтдельно.Видимость = Ложь;
	ИначеЕсли ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.РуководящийСостав") Тогда
		Элементы.ОргСхемаКонтекстноеМенюВывестиОтдельно.Видимость = Ложь;
	ИначеЕсли ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Департамент") Тогда
		Элементы.ОргСхемаКонтекстноеМенюВывестиОтдельно.Видимость = Истина;			
	ИначеЕсли ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел") Тогда
		Элементы.ОргСхемаКонтекстноеМенюВывестиОтдельно.Видимость = Ложь;
	ИначеЕсли ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Секция") ИЛИ ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Сектор") Тогда
	
		Элементы.ОргСхемаКонтекстноеМенюВывестиОтдельно.Видимость = Ложь;	
		Если ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Секция") И ЗначениеЗаполнено(ДанныеЭлемента.СсылкаНаВложеннуюОргсхему) Тогда
			Элементы.ОргСхемаКонтекстноеМенюОткрытьОргсхемуСекции.Видимость = истина;
		КонецЕсли;
	ИначеЕсли ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Сотрудник") Тогда
		Элементы.ОргСхемаКонтекстноеМенюВывестиОтдельно.Видимость = Ложь;
	Иначе
		 Элементы.ОргСхемаКонтекстноеМенюВывестиОтдельно.Видимость = Ложь;
	КонецЕсли;
	 
	Элементы.ОргСхемаКонтекстноеМенюИзменить.Видимость = Доступ.ОргсхемаРедактирование;
	Элементы.ОргСхемаКонтекстноеМенюУдалить.Видимость = Доступ.ОргсхемаРедактирование;
	Элементы.ОргСхемаКонтекстноеМенюПланы.Видимость = Доступ.БоевыеПланы;
	Элементы.ОргСхемаКонтекстноеМенюПоказатьСтатистики.Видимость = Доступ.Статистики;
	Элементы.ОргСхемаКонтекстноеМенюДолжностныеИнструкции.Видимость = Доступ.ДолжностныеИнструкции;
	Элементы.ОргСхемаКонтекстноеМенюДобавитьПодчиненного.Видимость = Доступ.ОргсхемаРедактирование;
	Элементы.ОргСхемаКонтекстноеМенюГруппа1.Видимость = Доступ.ЗадачиПланаДействийПросмотр;
	Элементы.ОргСхемаКонтекстноеМенюПоставитьЗадачу.Видимость = Доступ.ЗадачиПланаДействийРедактирование;
	Элементы.ОргСхемаКонтекстноеМенюОтправитьЗРС.Видимость = Доступ.ЗадачиПланаДействийРедактирование;
	Элементы.ОргСхемаКонтекстноеМенюОтправитьПослание.Видимость = Доступ.ЗадачиПланаДействийРедактирование;
	
 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДоступ()
	Структура = Новый Структура;
	Структура.Вставить("ОргсхемаРедактирование",			ПравоДоступаНаОбъект("Редактирование", 	"Справочник.Оргсхема"));
	Структура.Вставить("ДолжностныеИнструкции",				ПравоДоступаНаОбъект("Просмотр", 		"Справочник.ИА_Инструкции"));
	Структура.Вставить("БоевыеПланы",						ПравоДоступаНаОбъект("Просмотр", 		"Справочник.ИА_ПланыДействий"));
	Структура.Вставить("Статистики",						ПравоДоступаНаОбъект("Просмотр", 		"Документ.ИА_Статистика"));
	Структура.Вставить("ЗадачиПланаДействийПросмотр",		ПравоДоступаНаОбъект("Просмотр", 		"Задача.ИА_ЗадачаПланаДействий"));
	Структура.Вставить("ЗадачиПланаДействийРедактирование",	ПравоДоступаНаОбъект("Редактирование",	"Задача.ИА_ЗадачаПланаДействий")); 
	 
	Возврат Структура;	
КонецФункции

&НаСервереБезКонтекста
Функция ПравоДоступаНаОбъект(Право, ОбъектСтрокой)
	ОбМет = Метаданные.НайтиПоПолномуИмени(ОбъектСтрокой);//Если объекта в базе нет, то и прав нет, без ошибок
	Если ОбМет = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	Возврат ПравоДоступа(Право, ОбМет);
КонецФункции

&НаКлиенте
Процедура ПереместитьВлево(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;
	
	Если ТекЭлем = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПереместитьВлевоНаСервере(ТекЭлем);
	ОбновитьОС(МассивНарисованныхЭлементов);
КонецПроцедуры

&НаСервере
Процедура ПереместитьВлевоНаСервере(ТекЭлем)
ТекРодитель = ТекЭлем.Родитель;
	
	Если ЗначениеЗаполнено(ТекРодитель) и ТипЗнч(ТекРодитель) = Тип("СправочникСсылка.ОргСхема") Тогда
		Подчиненные = ПолучитьПодчиненные(ТекРодитель); 
		ТекСтрока = Подчиненные.Найти(ТекЭлем,"Ссылка" );
		Если ТекСтрока.НомерСтроки = 1 Тогда
			//СледСтрока = Подчиненные.Найти(Подчиненные.Количество(),"НомерСтроки" );
			Для каждого ТекЭлемент Из Подчиненные Цикл
				Если ТекЭлемент = ТекСтрока Тогда
					ТекОбъект = ТекЭлемент.Ссылка.ПолучитьОбъект();
					ТекОбъект.ПорядокВСхеме = Подчиненные.Найти(Подчиненные.Количество(),"НомерСтроки" ).ПорядокВСхеме;
					ТекОбъект.Записать();
				Иначе
					ТекОбъект = ТекЭлемент.Ссылка.ПолучитьОбъект();
					ТекОбъект.ПорядокВСхеме = ТекОбъект.ПорядокВСхеме-1;
					ТекОбъект.Записать();
				КонецЕсли;
			КонецЦикла;

		Иначе
			СледСтрока = Подчиненные.Найти(ТекСтрока.НомерСтроки-1,"НомерСтроки" );
			ТекОбъект = ТекСтрока.Ссылка.ПолучитьОбъект();
			ТекОбъект.ПорядокВСхеме = СледСтрока.ПорядокВСхеме;
			ТекОбъект.Записать();
			СледОбъект = СледСтрока.Ссылка.ПолучитьОбъект();
			СледОбъект.ПорядокВСхеме = ТекСтрока.ПорядокВСхеме;
			СледОбъект.Записать();
		КонецЕсли;
		
		
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВывестиОтдельно(Команда)
	
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	//ОбновитьОС(МассивНарисованныхЭлементов); 
	ТекЭлем = ТекОбласть.Расшифровка;
	Лево = 0;
	Верх = 0;
	Ширина = 0;
	
	Если ЭтоБлокДепартамента(ТекЭлем) Тогда
		Для каждого Элем из МассивНарисованныхЭлементов Цикл
			Если ТекЭлем = Элем.Ссылка Тогда
				Лево = Элем.Лево;
				Верх = Элем.Верх;
				Ширина = Элем.Ширина;
				Прервать;
			КонецЕсли;      		
		КонецЦикла;	
		 		
		Форма = ПолучитьФорму("Обработка.ОргСхема.Форма.ФормаВыводаБлокаУпр");
		
		Если Форма.Открыта() Тогда 
			Форма.Закрыть();
			Форма = ПолучитьФорму("Обработка.ОргСхема.Форма.ФормаВыводаБлокаУпр");
		КонецЕсли;	   
		
		Форма.ВладелецФормы = ЭтаФорма;
		Структура = Новый ФиксированнаяСтруктура("Организация, Департамент, Лево, Верх, Ширина",
												Объект.Организация, ТекЭлем, Лево, Верх, Ширина);	
		Форма.ФиксСтруктура = Структура;
		Форма.Открыть(); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоБлокДепартамента(ТекЭлем)
	Возврат ТекЭлем <> Неопределено И ТекЭлем.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Департамент");	
КонецФункции

&НаКлиенте
Процедура ДвойноеПодчинение(Команда)
	ПолучитьДвойноеПодчинение(Объект.Организация);
	Если Проблемы.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Двойного подчинения не обнаружено");
	Иначе
		Элементы.ГруппаСписокПроблем.Видимость = Истина;
		Элементы.ГруппаПробл.ТекущаяСтраница = Элементы.Двойные;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерекрестноеПодчинение(Команда)
	ПолучитьПерекрестноеПодчинение(Объект.Организация);	
	Если ПроблемыПерекрест.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Перекрестного подчинения не обнаружено");
	Иначе
		Элементы.ГруппаСписокПроблем.Видимость = Истина;
		Элементы.ГруппаПробл.ТекущаяСтраница = Элементы.Перекрестные;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьПерекрестноеПодчинение(Организация)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = "ВЫБРАТЬ 
	               |	ОргСхемаСотрудники.Ссылка КАК Пост,
	               |	ОргСхемаСотрудники.ФизЛицо КАК ФизЛицо
	               |ИЗ
	               |	Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
	               |ГДЕ
	               |	ОргСхемаСотрудники.Ссылка В ИЕРАРХИИ(&Организация)
	               |	И НЕ ОргСхемаСотрудники.Ссылка.ПометкаУдаления
	               |	И ОргСхемаСотрудники.НомерСтроки = 1";
	тзОргсх = Запрос.Выполнить().Выгрузить();
	ПараметрыСтроки = Новый КвалификаторыСтроки(150);
	тзОргсх.Колонки.Добавить("ПолныйКод", Новый ОписаниеТипов("Строка",,ПараметрыСтроки));
	
	Для каждого стр из тзОргсх Цикл
		стр.ПолныйКод = стр.Пост.ПолныйКод();
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	тз.Пост,
	               |	тз.ПолныйКод,
	               |	тз.ФизЛицо
	               |ПОМЕСТИТЬ ОргСхема
	               |ИЗ
	               |	&ТЗ КАК тз
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОргСхема.Пост КАК Пост1,
	               |	ОргСхема.ФизЛицо КАК Сотрудник,
	               |	ЭтотНиже.Пост КАК Пост2,
	               |	ДругойНижеЭтого.Пост КАК ПостСередина,
	               |	ДругойНижеЭтого.ФизЛицо КАК СотрудникСередина
	               |ИЗ
	               |	ОргСхема КАК ОргСхема
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОргСхема КАК ДругойНижеЭтого
	               |		ПО (ДругойНижеЭтого.ФизЛицо <> ОргСхема.ФизЛицо)
	               |			И (ДругойНижеЭтого.ПолныйКод ПОДОБНО ОргСхема.ПолныйКод + ""/%"")
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОргСхема КАК ЭтотНиже
	               |		ПО (ЭтотНиже.ФизЛицо = ОргСхема.ФизЛицо)
	               |			И (ЭтотНиже.ПолныйКод ПОДОБНО ДругойНижеЭтого.ПолныйКод + ""/%"")";
				   
	Запрос.УстановитьПараметр("тз", тзОргсх);			   
	тз = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(тз,"ПроблемыПерекрест");	
КонецПроцедуры


&НаСервере
Процедура ПолучитьДвойноеПодчинение(Организация)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.Ссылка КАК Пост,
	               |	ОргСхема.Родитель КАК ПостРуководитель
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |ГДЕ
	               |	ОргСхема.Ссылка В ИЕРАРХИИ(&Организация)
	               |	И НЕ ОргСхема.ПометкаУдаления";
	тзПодчинение = Запрос.Выполнить().Выгрузить();
	
	Для каждого стр из тзПодчинение Цикл
		пока стр.ПостРуководитель.Сотрудники.Количество() = 0 и ЗначениеЗаполнено(стр.ПостРуководитель.Родитель) Цикл
			стр.ПостРуководитель = стр.ПостРуководитель.Родитель;
		КонецЦикла;
	КонецЦикла;

	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Пост,
	               |	ТЗ.ПостРуководитель
	               |ПОМЕСТИТЬ НепосрРукли
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОргСхемаСотрудники.ФизЛицо КАК Руководитель,
	               |	ОргСхемаСотрудники.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ПервыеСотрудники
	               |ИЗ
	               |	Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
	               |ГДЕ
	               |	ОргСхемаСотрудники.Ссылка В ИЕРАРХИИ(&Организация)
	               |	И НЕ ОргСхемаСотрудники.Ссылка.ПометкаУдаления
	               |	И ОргСхемаСотрудники.НомерСтроки = 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОргСхемаСотрудники.ФизЛицо КАК ФизЛицо,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПервыеСотрудники.Руководитель) КАК КолРуководителей
	               |ПОМЕСТИТЬ ПроблемныеСотрудники
	               |ИЗ
	               |	НепосрРукли КАК НепосрРукли
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
	               |		ПО НепосрРукли.Пост = ОргСхемаСотрудники.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервыеСотрудники КАК ПервыеСотрудники
	               |		ПО НепосрРукли.ПостРуководитель = ПервыеСотрудники.Ссылка
	               |			И (ОргСхемаСотрудники.ФизЛицо <> ПервыеСотрудники.Руководитель)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОргСхемаСотрудники.ФизЛицо
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПервыеСотрудники.Руководитель) > 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОргСхемаСотрудники.Ссылка КАК Пост,
	               |	Проблемы.ФизЛицо КАК Сотрудник,
	               |	НепосрРукли.ПостРуководитель,
	               |	ПервыеСотрудники.Руководитель КАК Руководитель
	               |ИЗ
	               |	Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПроблемныеСотрудники КАК Проблемы
	               |		ПО ОргСхемаСотрудники.ФизЛицо = Проблемы.ФизЛицо
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НепосрРукли КАК НепосрРукли
	               |		ПО (НепосрРукли.Пост = ОргСхемаСотрудники.Ссылка)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервыеСотрудники КАК ПервыеСотрудники
	               |		ПО (НепосрРукли.ПостРуководитель = ПервыеСотрудники.Ссылка)
	               |			И (Проблемы.ФизЛицо <> ПервыеСотрудники.Руководитель)
	               |ГДЕ
	               |	ОргСхемаСотрудники.Ссылка В ИЕРАРХИИ(&Организация)
	               |	И НЕ ОргСхемаСотрудники.Ссылка.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник";
	
	Запрос.УстановитьПараметр("ТЗ", тзПодчинение);
	тз = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(тз,"Проблемы");
КонецПроцедуры

&НаСервере
Процедура СнятьВыделение()
	Если ПредВыделение <> Неопределено ТОгда
		Для каждого рис из ПредВыделение Цикл
			рис.Узор = ТипУзораТабличногоДокумента.Сплошной;;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура ПроблемыПриАктивизацииСтроки(Элемент)
	тд = Элементы.Проблемы.ТекущиеДанные;
	Если тд = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	текИд = тд.ПолучитьИдентификатор();
	Если текИд = ПредИдЭлем Тогда
		Возврат;
	КонецЕсли;
	ПредИдЭлем = текИд;
	
	
	
	МассивПостов = Новый Массив;
	Для каждого стрИД из Элементы.Проблемы.ВыделенныеСтроки Цикл
		МассивПостов.Добавить(Проблемы.НайтиПоИдентификатору(стрИД).Пост);
	КонецЦикла;
	
	лево = ПроблемыПриАктивизацииСтрокиНаСервер(МассивПостов);
	
	Если лево> 0 Тогда
		Итер = 0;
		ПодключитьОбработчикОжидания("Спозиционировать", 0.1, истина);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроблемыПриАктивизацииСтрокиНаСервер(МассивПостов)
	
	СнятьВыделение();	
	Первый = истина;
	ПредВыделение = Новый Массив;
	Лево = 0;
	Верх = 0;
	Для каждого рис из ОргСхема.Рисунки Цикл
		Если рис.ТипРисунка = ТипРисункаТабличногоДокумента.Текст И МассивПостов.Найти(рис.Расшифровка)<>Неопределено и рис.Текст<>"" Тогда
			
			ПредВыделение.Добавить(рис);
			
			рис.Узор = ТипУзораТабличногоДокумента.Узор15;
			рис.ЦветУзора = Новый Цвет(250,50,50);
			
			Если Первый Тогда
				Лево = рис.Лево;
				Верх = рис.Верх;
				Первый = ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Лево;
КонецФункции

&НаКлиенте
Процедура Спозиционировать() Экспорт
	Колонка = Макс(Окр(Лево / 16.3,  0),1);
	Строка  = Макс(Окр(Верх /  3.8, 0), 1);
	Если итер = 0 Тогда // пляшем влево
		Колонка1 = Макс(Колонка - 8,1);
		Строка1  = Макс(Строка - 15, 1);
		СпозиционироватьНаКолонкеСтроке(Колонка1, Строка1);
	ИначеЕсли итер = 1 Тогда // пляшем вправо
		Колонка1 = Колонка + 8;
		Строка1  = Строка + 15;
		СпозиционироватьНаКолонкеСтроке(Колонка1, Строка1);
	ИначеЕсли итер = 2 Тогда // топаем ногой
		СпозиционироватьНаКолонкеСтроке(Колонка, Строка);
	КонецЕсли;

	Итер = Итер + 1;
	
	Если итер < 3 Тогда
		ПодключитьОбработчикОжидания("Спозиционировать", 0.1, истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СпозиционироватьНаКолонкеСтроке(Колонка, Строка)
	Колонка = Формат(Колонка, "ЧДЦ=; ЧГ=");
	Строка  = Формат(Строка, "ЧДЦ=; ЧГ=");
	Обл = ОргСхема.Область("R" + Строка + "C" + Колонка);
	Элементы.ОргСхема.ТекущаяОбласть = Обл;
КонецПроцедуры

&НаКлиенте
Процедура УбратьСписокПроблем(Команда)
	СнятьВыделение();
	Элементы.ГруппаСписокПроблем.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПроблемыПерекрестПриАктивизацииСтроки(Элемент)
	тд = Элементы.ПроблемыПерекрест.ТекущиеДанные;
	Если тд = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	текИд = тд.ПолучитьИдентификатор();
	Если текИд = ПредИдЭлем1 Тогда
		Возврат;
	КонецЕсли;
	ПредИдЭлем1 = текИд;
	
	МассивПостов = Новый Массив;
	Для каждого стрИД из Элементы.ПроблемыПерекрест.ВыделенныеСтроки Цикл
		ТекСтр = ПроблемыПерекрест.НайтиПоИдентификатору(стрИД);
		МассивПостов.Добавить(ТекСтр.Пост1);
		МассивПостов.Добавить(ТекСтр.Пост2);
		МассивПостов.Добавить(ТекСтр.ПостСередина);
	КонецЦикла;
	
	Лево = ПроблемыПерекрестПриАктивизацииСтрокиНаСервере(МассивПостов);
	
	Если лево> 0 Тогда
		Итер = 0;
		ПодключитьОбработчикОжидания("Спозиционировать", 0.1, истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроблемыПерекрестПриАктивизацииСтрокиНаСервере(МассивПостов)	
	СнятьВыделение();
	Первый = истина;
	ПредВыделение = Новый Массив;
	Лево = 0;
	Верх = 0;
	Для каждого рис из ОргСхема.Рисунки Цикл
		Если рис.ТипРисунка = ТипРисункаТабличногоДокумента.Текст И МассивПостов.Найти(рис.Расшифровка)<>Неопределено и рис.Текст<>"" Тогда
			
			ПредВыделение.Добавить(рис);
			
			рис.Узор = ТипУзораТабличногоДокумента.Узор15;
			рис.ЦветУзора = Новый Цвет(250,50,50);
			
			Если Первый Тогда
				Лево = рис.Лево;
				Верх = рис.Верх;
				Первый = ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВОзврат Лево;
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьСотрудники(пПост)
	возврат пПост.Сотрудники.Количество()>0;
КонецФункции

&НаКлиенте
Процедура ПроцентыВыполненияБП(Команда)
	ПроцентыВыполненияБП_Сервер(МассивНарисованныхЭлементов);
	//ПолучитьПроцентыВыполненияПланов();
	//
	//Для каждого стр из МассивНарисованныхЭлементов Цикл
	//	Если   (стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.РуководящийСостав")
	//	  ИЛИ  стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Департамент")
	//	  ИЛИ  стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел")) И ЕстьСотрудники(стр.Ссылка) Тогда
	//	  
	//	  	ТекстБП = "НЕТ БП";
	//	  	Для каждого стрПост из ПроцентыПланов Цикл
	//			Если стрПост.Пост = стр.Ссылка Тогда
	//				ТекстБП = формат(?(стрПост.ИтогоВремя = 0, 0, стрПост.ВыполненоВремя / стрПост.ИтогоВремя * 100),"ЧДЦ=; ЧН=")+"%"; 
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Элем = ОргСхема.Рисунки[стр.Элемент];			
	//		
	//		ПодписьБП = ОргСхема.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	//		ЗаполнитьЗначенияСвойств(ПодписьБП, Элем);
	//		ПодписьБП.Высота = 7;
	//		ПодписьБП.Ширина = 20;
	//		ПодписьБП.Лево = Элем.Лево + Элем.Ширина - ПодписьБП.Ширина;
	//		
	//		ПодписьБП.Узор = ТипУзораТабличногоДокумента.Сплошной;
	//		ПодписьБП.ЦветФона = Новый Цвет(184,214,255);
	//		ПодписьБП.Текст = ТекстБП;
	//		
	//		ПодписьБП.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная,2);
	//		ПодписьБП.ЦветЛинии = Новый Цвет(0,10,255);
	//		
	//		ПодписьБП.Шрифт = Новый Шрифт(ПодписьБП.Шрифт,,9,истина,ложь, ложь,ложь);

	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроцентыВыполненияБП_Сервер(МассивНарисованныхЭлементов)
	ПроцентыПланов = ПолучитьПроцентыВыполненияПланов();
	
	Для каждого стр из МассивНарисованныхЭлементов Цикл
		Если   (стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.РуководящийСостав")
		  ИЛИ  стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Департамент")
		  ИЛИ  стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел")) И ЕстьСотрудники(стр.Ссылка) Тогда
		  
		  	ТекстБП = "НЕТ БП";
			нстроки = ПроцентыПланов.НайтиСтроки(новый структура("Пост", стр.Ссылка));
			//Для каждого стрПост из ПроцентыПланов Цикл
			//	Если стрПост.Пост = стр.Ссылка Тогда
			//		ТекстБП = формат(?(стрПост.ИтогоВремя = 0, 0, стрПост.ВыполненоВремя / стрПост.ИтогоВремя * 100),"ЧДЦ=; ЧН=")+"%"; 
			//		Прервать;
			//	КонецЕсли;
			//КонецЦикла;
			Если нстроки.количество()>0 Тогда
				ТекстБП = формат(?(нстроки[0].ИтогоВремя = 0, 0, нстроки[0].ВыполненоВремя / нстроки[0].ИтогоВремя * 100),"ЧДЦ=; ЧН=")+"%"; 
			КонецЕсли;
			
			Элем = ОргСхема.Рисунки[стр.Элемент];			
			
			ПодписьБП = ОргСхема.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
			ЗаполнитьЗначенияСвойств(ПодписьБП, Элем);
			ПодписьБП.Высота = 7;
			ПодписьБП.Ширина = 20;
			ПодписьБП.Лево = Элем.Лево + Элем.Ширина - ПодписьБП.Ширина;
			
			ПодписьБП.Узор = ТипУзораТабличногоДокумента.Сплошной;
			ПодписьБП.ЦветФона = Новый Цвет(184,214,255);
			ПодписьБП.Текст = ТекстБП;
			
			ПодписьБП.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная,2);
			ПодписьБП.ЦветЛинии = Новый Цвет(0,10,255);
			
			ПодписьБП.Шрифт = Новый Шрифт(ПодписьБП.Шрифт,,9,истина,ложь, ложь,ложь);

		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьПроцентыВыполненияПланов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ИА_ПланыДействийШаги.Время) КАК ИтогоВремя,
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_ПланыДействийШаги.Выполнено
	               |				ТОГДА ИА_ПланыДействийШаги.Время
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ВыполненоВремя,
	               |	ИА_ПланыДействийШаги.Владелец.Пост КАК Пост
	               |ИЗ
	               |	Справочник.ИА_ЗадачиПлана КАК ИА_ПланыДействийШаги
	               |ГДЕ
	               |	ИА_ПланыДействийШаги.Владелец.ПометкаУдаления = ЛОЖЬ
	               |	И ИА_ПланыДействийШаги.Владелец.ДатаНачала >= &ДатаНачала
	               |	И ИА_ПланыДействийШаги.Владелец.Родитель = ЗНАЧЕНИЕ(Справочник.ИА_ПланыДействий.ПустаяСсылка)
	               |	И ИА_ПланыДействийШаги.Пост.ТипТерминала В(&ТипТерминала)
	               |	И ИА_ПланыДействийШаги.Пост В ИЕРАРХИИ(&Пост)
	               |	И ИА_ПланыДействийШаги.ПометкаУдаления = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_ПланыДействийШаги.Владелец.Пост";
	ТипыТ = Новый Массив;
	ТипыТ.Добавить(Перечисления.ТипТерминалаОргСхемы.РуководящийСостав);
	ТипыТ.Добавить(Перечисления.ТипТерминалаОргСхемы.Департамент);
	ТипыТ.Добавить(Перечисления.ТипТерминалаОргСхемы.Отдел);
	
	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата() - 60*60*24*7*6);
	Запрос.УстановитьПараметр("ТипТерминала", ТипыТ);
	Запрос.УстановитьПараметр("Пост", Объект.Организация);
	
	тз = Запрос.Выполнить().Выгрузить();
	
	//ЗначениеВРеквизитФормы(тз,"ПроцентыПланов");
	возврат тз;
КонецФункции

&НаКлиенте
Процедура ОткрытьОргсхемуСекции(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;
		 		
	Форма = ПолучитьФорму("Обработка.ОргСхема.Форма.ФормаУпр",,,Истина);
	Форма.объект.организация = ПолучитьВложОргсхему(ТекЭлем);
	Форма.Открыть(); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВложОргсхему(пПост)
	возврат пПост.СсылкаНаВложеннуюОргсхему;
КонецФункции

&НаКлиенте
Процедура Переместить(Команда)
	ТекОбласть = Элементы.ОргСхема.ТекущаяОбласть;
	ТекЭлем = ТекОбласть.Расшифровка;	
	Если ТекЭлем = Неопределено Тогда
		Элементы.ОргСхемаКонтекстноеМенюВывестиОтдельно.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	ДанныеЭлемента = СсылкуВСтруктуру(ТекЭлем, "Ссылка, ТипТерминала,СсылкаНаВложеннуюОргсхему");
	
	Если ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Учредитель") или ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Организация") Тогда
		Возврат;
	КонецЕсли;

	Список = Новый СписокЗначений;
	Если ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Департамент") 
		ИЛИ ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел")
		ИЛИ ДанныеЭлемента.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.РуководящийСостав")
		Тогда
		Список.Добавить("Влево");
		Список.Добавить("Вправо");
	Иначе
		Список.Добавить("Вверх");
		Список.Добавить("Вниз");
	КонецЕсли;
	
	Параметр = новый Структура("ТекЭлем",ТекЭлем);
	Оп = Новый ОписаниеОповещения("ПереместитьПослеВыбора", ЭтотОбъект, Параметр);
	ПоказатьВыборИзСписка(Оп, Список);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьПослеВыбора(ВыбранныйЭлемент, ДопПарам) Экспорт
	Если  ВыбранныйЭлемент = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	зн = ВыбранныйЭлемент.значение;
	ТекЭлем = ДопПарам.ТекЭлем;
	Если зн  = "Влево" или зн = "Вверх" Тогда
		ПереместитьВлевоНаСервере(ТекЭлем);		
	Иначе
		ПереместитьВправоНаСервере(ТекЭлем);
	КонецЕсли;
	ОбновитьОС(МассивНарисованныхЭлементов);
КонецПроцедуры
